base/DataProcessors/бит_ФормированиеОтраженийФактаДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ФормированиеОтраженийФактаДДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражениеФактаДДССоздано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>Организация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Comment>Документ</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетБанкаПоОперациямЭквайринга</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Comment>Номер документа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Comment>Дата документа</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Comment>Сумма документа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Comment>Валюта документа</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеФактаДДС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ОтражениеФактаДДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХозяйственнаяОперация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/DataProcessors/бит_ФормированиеОтраженийФактаДДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
#Область СлужебныйПрограммныйИнтерфейс

Функция ИнициализироватьКомпоновщик(Компоновщик, ВыбранныеТипы, НастройкиКомпоновкиДанных) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьМакет("СхемаПодбора");

	ИзменитьСхемуКомпоновки(СхемаКомпоновкиДанных, ВыбранныеТипы);
		
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	Попытка
		Компоновщик.Инициализировать(ИсточникНастроек);	
	Исключение 
		ТекстСообщения = НСтр("ru='Невозможно применить настройки. По причине: %1';
							  |en='It is impossible to apply the settings. Due to: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		 
	КонецПопытки;
	
	Если НастройкиКомпоновкиДанных.Выбор.Элементы.Количество() = 0 Тогда
		Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе	
		НастройкиКомпоновкиДанных.Выбор.Элементы.Очистить();
		ШаблонКоллекции = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Выбор.Элементы;
		Коллекция		= НастройкиКомпоновкиДанных.Выбор.Элементы; 
		Для каждого Элемент Из ШаблонКоллекции Цикл
			НовоеПоле = Коллекция.Добавить(ТипЗнч(Элемент));
			ЗаполнитьЗначенияСвойств(НовоеПоле, Элемент);	
		КонецЦикла;
		Компоновщик.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
		Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	КонецЕсли;
	
	Возврат АдресСхемыКомпоновкиДанных;
	
КонецФункции

Функция ВыбранныеТипы(ТипыДокументов) Экспорт

	ВыбранныеТипы = Новый Массив;
	Для каждого СтрокаТаблицы Из ТипыДокументов Цикл
		Если СтрокаТаблицы.Пометка Тогда
			ВыбранныеТипы.Добавить(СтрокаТаблицы.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыбранныеТипы;
	
КонецФункции

Процедура ЗаполнитьТипыДокументов(ТипыДокументов) Экспорт
	
	ТипыДокументов.Очистить();
	
	ТипыОбъектовДляЗаполнения = Метаданные.Документы.бит_ОтражениеФактаДДС.Реквизиты.ДокументОснование.Тип.Типы();
	Для каждого Элемент Из ТипыОбъектовДляЗаполнения Цикл
		МетаданныеОснования = Метаданные.НайтиПоТипу(Элемент);
		Если ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(МетаданныеОснования)
		   И ПравоДоступа("Чтение", МетаданныеОснования) Тогда
		   
			НоваяСтрока = ТипыДокументов.Добавить();
			НоваяСтрока.Пометка		  = Истина;
			НоваяСтрока.Значение	  = МетаданныеОснования.ПолноеИмя();
			НоваяСтрока.Представление = МетаданныеОснования.Представление();
		КонецЕсли;
	КонецЦикла;
	
	ТипыДокументов.СортироватьПоПредставлению();
	
КонецПроцедуры

Функция ПрименитьНастройки(НастройкаПодбораДокументов, ТипыДокументов, Обработка) Экспорт
	
	ШаблонНастроек = НовыеСохраняемыеНастройки();

	Если ЗначениеЗаполнено(НастройкаПодбораДокументов) Тогда
		
		РеквизитыНастройки 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаПодбораДокументов, "ХранилищеНастроек");
		СохраненныеНастройки = РеквизитыНастройки.ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ШаблонНастроек, СохраненныеНастройки);
		КонецЕсли;  		
	КонецЕсли;
	
	ВыбранныеТипы = ШаблонНастроек.ВыбранныеТипы;
	Если ЗначениеЗаполнено(ВыбранныеТипы) Тогда
		ТипыДокументов.ЗаполнитьПометки(Ложь);
		Для каждого Элемент Из ВыбранныеТипы Цикл
			РезультатПоиска = ТипыДокументов.НайтиПоЗначению(Элемент);
			Если РезультатПоиска <> Неопределено Тогда
				РезультатПоиска.Пометка = Истина;				
			КонецЕсли;		
		КонецЦикла;
		ВыбранныеТипы = ВыбранныеТипы(ТипыДокументов);
	Иначе
		ВыбранныеТипы = ТипыДокументов.ВыгрузитьЗначения();	
	КонецЕсли;	
		
	АдресСКД = ИнициализироватьКомпоновщик(Обработка.КомпоновщикНастроек,
					ВыбранныеТипы, ШаблонНастроек.НастройкиКомпоновкиДанных);
							
	НастройкаПериода = Новый СтандартныйПериод(ШаблонНастроек.ВариантПериода);
	Обработка.Период = НастройкаПериода;

	Возврат АдресСКД;
	
КонецФункции

Функция НовыеСохраняемыеНастройки() Экспорт 

	СохраняемыеНастройки = Новый Структура;
	СохраняемыеНастройки.Вставить("ВариантПериода",			   ВариантСтандартногоПериода.ЭтотМесяц);
	СохраняемыеНастройки.Вставить("НастройкиКомпоновкиДанных", Новый НастройкиКомпоновкиДанных);
	СохраняемыеНастройки.Вставить("ВыбранныеТипы",			   Новый Массив);
	
	Возврат СохраняемыеНастройки;

КонецФункции

Функция ЗаполнитьПереченьДокументов(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных) Экспорт

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,,,
							Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаПереченьПолный = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаПереченьПолный);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			
	Возврат ТаблицаПереченьПолный;
	
КонецФункции

Функция НовыеДокументыОтраженияФакта(ТаблицаДокументов) Экспорт
	
	ДобавленныеДокументы = Новый Соответствие;

	Если НЕ ЗначениеЗаполнено(ТаблицаДокументов) Тогда
		Возврат ДобавленныеДокументы;
	КонецЕсли;

	Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл		
		Если НЕ СтрокаТаблицы.Пометка Тогда 
			Продолжить;
		КонецЕсли;
		
		Попытка
			НачатьТранзакцию();
			
			ТекущийДокумент = Строка(СтрокаТаблицы.Документ); 
			Отказ			= Ложь;
			
			ОтражениеФакта = Документы.бит_ОтражениеФактаДДС.СоздатьДокумент();
			ОтражениеФакта.Заполнить(СтрокаТаблицы.Документ);
			Документы.бит_ОтражениеФактаДДС.ОбработатьСобытиеПриЗаписиПлатежногоДокумента(ОтражениеФакта, СтрокаТаблицы.Документ, Отказ);
			ОтражениеФакта.Записать(РежимЗаписиДокумента.Запись);
			
			Если Отказ Тогда
				ТекстСообщения = НСтр("ru = 'Не удалось записать ""Отражение факта"" для документа %1.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийДокумент);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			
			ДокументПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Документ, "Проведен");
			Если ДокументПроведен Тогда
				Попытка
					бит_Казначейство.ОбработкаПроведенияПлатежногоДокумента(СтрокаТаблицы.Документ.ПолучитьОбъект(),
						Отказ, РежимЗаписиДокумента.Запись, Истина);	
				Исключение
					ТекстСообщения = НСтр("ru = 'Не удалось отразить фактические данные у документа %1. По причине: %2'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийДокумент, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					ВызватьИсключение ТекстСообщения;
				КонецПопытки;
			КонецЕсли;
			
			ДобавленныеДокументы.Вставить(СтрокаТаблицы.Документ, ОтражениеФакта.Ссылка);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
	Возврат ДобавленныеДокументы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьСхемуКомпоновки(СхемаКомпоновкиДанных, ВыбранныеТипы)
	
	// Поля, используемые для отборов, которые требуется удалить, 
	// если таких нет в метаданных.
	РеквизитыШапки = Новый Структура; 
	РеквизитыШапки.Вставить("Контрагент", Ложь);

	// Изменим текст запроса:
	ШаблонТекстаЗапроса = СхемаКомпоновкиДанных.НаборыДанных.Документы.Запрос; 
	ТекстЗапроса 		= ТекстЗапросаДокументы(ШаблонТекстаЗапроса, РеквизитыШапки, ВыбранныеТипы);	
	СхемаКомпоновкиДанных.НаборыДанных.Документы.Запрос = ТекстЗапроса;
	
	Если ВыбранныеТипы.Количество() <> 0 Тогда
		Индекс = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор.Элементы.Количество() - 1;
		Пока Индекс >= 0  Цикл
			ЭлементОтбора = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор.Элементы.Получить(Индекс);
			Ключ = Строка(СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор.Элементы.Получить(Индекс).ЛевоеЗначение);
			Если СтрНачинаетсяС(Ключ, "Документ.") Тогда
				Ключ = СтрЗаменить(Ключ, "Документ.","");
				Пометка = Ложь;
				Если РеквизитыШапки.Свойство(Ключ, Пометка) И Пометка = Ложь Тогда
					СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор.Элементы.Удалить(Индекс);				
				КонецЕсли; 
			КонецЕсли; 
			Индекс = Индекс - 1;
		КонецЦикла;  
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаДокументы(ШаблонТекстаЗапроса, РеквизитыШапки, ВыбранныеТипы)

	Если ВыбранныеТипы.Количество() = 0 Тогда
		Возврат ШаблонТекстаЗапроса;
	КонецЕсли; 
	
	// Описание полей, где: 
	// Значение, Представление, Пометка - это "Имя", "Синоним", "Выбор реквизитов".
	ФиксированныеПоля = Новый СписокЗначений;
	ФиксированныеПоля.Добавить("Ссылка",		  		"Документ", Истина);
	ФиксированныеПоля.Добавить("Номер", 		  		"Номер");
	ФиксированныеПоля.Добавить("Дата", 			  		"Дата");
	ФиксированныеПоля.Добавить("Проведен", 		  		"Проведен");
	ФиксированныеПоля.Добавить("ПометкаУдаления", 		"ПометкаУдаления");
	ФиксированныеПоля.Добавить("Организация", 	  		"Организация", Истина);
	ФиксированныеПоля.Добавить("Контрагент", 	  		"Контрагент", Истина);
	ФиксированныеПоля.Добавить("Валюта",		  		"Валюта", Истина);
	ФиксированныеПоля.Добавить("СуммаДокумента",  		"СуммаДокумента");
	ФиксированныеПоля.Добавить("ХозяйственнаяОперация", "ХозяйственнаяОперация");
	ФиксированныеПоля.Добавить("БанковскийСчет",  		"БанковскийСчет");
		
	СтрокаНеограниченнойДлинны = ОбщегоНазначения.ОписаниеТипаСтрока(0); 
	
	СхемаЗапроса					   = Новый СхемаЗапроса;
	СхемаЗапроса.РежимКомпоновкиДанных = Истина;
	
	Запрос = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Запрос.ВыбиратьРазрешенные = Истина;
	Запрос.ТаблицаДляПомещения = "ТабДокументы";
	
	Индекс = 0;
	Для Каждого ВыбранныйТип Из ВыбранныеТипы Цикл
				
		Если Индекс = 0 Тогда
			Оператор = Запрос.Операторы[0];
		Иначе	
			Оператор = Запрос.Операторы.Добавить();
			Оператор.ТипОбъединения = ТипОбъединенияСхемыЗапроса.ОбъединитьВсе;
		КонецЕсли; 		

		Источник = Оператор.Источники.Добавить(ВыбранныйТип);	
		Таблица  = Источник.Источник;
		Для Каждого ФиксированноеПоле Из ФиксированныеПоля Цикл
			
			ИндексКолонки = ФиксированныеПоля.Индекс(ФиксированноеПоле);			
			ДоступноеПоле = Таблица.ДоступныеПоля.Найти(ФиксированноеПоле.Значение);
			
			Если ДоступноеПоле <> Неопределено Тогда
				Если ДоступноеПоле.ТипЗначения = СтрокаНеограниченнойДлинны Тогда
					// Обрежем поля неограниченной длины.
					Выражение = СтрШаблон("ВЫРАЗИТЬ(%1 КАК Строка (210))", ДоступноеПоле.Имя);
					Оператор.ВыбираемыеПоля.Добавить(Выражение, ИндексКолонки);
				Иначе
					Оператор.ВыбираемыеПоля.Добавить(ДоступноеПоле, ИндексКолонки);
					
					ВыраженияОтбора = Оператор.ВыраженияОтбораКомпоновкиДанных;
					ВыражениеОтбора = ВыраженияОтбора.Добавить(ДоступноеПоле);
					ВыражениеОтбора.ИспользоватьРеквизиты = ФиксированноеПоле.Пометка;
					ВыражениеОтбора.Псевдоним			  = ФиксированноеПоле.Представление;
				КонецЕсли;
			Иначе	
				Оператор.ВыбираемыеПоля.Добавить("NULL", ИндексКолонки);
			КонецЕсли; 
			
			// Выявляем хотя бы одну таблицу с доступным реквизитом шапки.
			Ключ = ФиксированноеПоле.Значение;
			Если РеквизитыШапки.Свойство(Ключ) Тогда
				Если ДоступноеПоле = Неопределено Тогда
					РеквизитыШапки[Ключ] = Макс(Ложь, РеквизитыШапки[Ключ]);
				Иначе	
					РеквизитыШапки[Ключ] = Макс(Истина, РеквизитыШапки[Ключ]);
				КонецЕсли; 
			КонецЕсли; 

			Если Индекс = 0 Тогда
				Запрос.Колонки[ИндексКолонки].Псевдоним = ФиксированноеПоле.Представление;
			КонецЕсли;	
		КонецЦикла;
		
		Оператор.Отбор.Добавить("Дата Между &ДатаНачала И &ДатаОкончания");
		Оператор.Отбор.Добавить("НЕ ПометкаУдаления");
		
		Индекс = Индекс + 1;
	КонецЦикла; 
	// Заменим "эталонный запрос".
	ИсходнаяСхема						= Новый СхемаЗапроса;
	ИсходнаяСхема.РежимКомпоновкиДанных = Истина;
	ИсходнаяСхема.УстановитьТекстЗапроса(ШаблонТекстаЗапроса);
	ИсходнаяСхема.ПакетЗапросов[0].УстановитьТекстЗапроса(СхемаЗапроса.ПолучитьТекстЗапроса());
	
	ТекстЗапроса = ИсходнаяСхема.ПолучитьТекстЗапроса();
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
